app/controllers/codes_controller.rb

INSERT INTO "codes" ("created_at", "ip", "key_a", "key_b", "master", "message", "message_coded", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def encode
    @code = Code.new(params[:code])
    @code.message_coded = encode_message(@code.master, @code.key_a, @code.key_b, @code.message)
    @code.ip = request.remote_ip
    @message = @code

    @code.save if @code.message_coded